org/Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009
#+TITLE: Catalogue of Spacetimes by Mueller and Grave in 2009
* 1 Introduction and Notation
** 1.1 Notation
** 1.2 General remarks
** 1.3 Basic objects of a metric
** 1.4 Natural local tetrad and initial conditions for geodesics
*** 1.4.1 Orthonormality condition
*** 1.4.2 Tetrad transformations
*** 1.4.3 Ricci rotation-, connection-, and structure coefficients
*** 1.4.4 Riemann-, Ricci-, and Weyl-tensor with respect to a local tetrad
*** 1.4.5 Null or timelike directions
*** 1.4.6 Local tetrad for diagonal metrics
*** 1.4.7 Local tetrad for stationary axisymmetric spacetimes
** 1.5 Newman-Penrose tetrad and spin-coefficients
** 1.6 Coordinate relations
*** 1.6.1 Spherical and Cartesian coordinates
*** 1.6.2 Cylindrical and Cartesian coordinates
** 1.7 Embedding diagram
** 1.8 Equations of motion and transport equations
*** 1.8.1 Geodesic equation
*** 1.8.2 Fermi-Walker transport
*** 1.8.3 Parallel transport
*** 1.8.4 Euler-Lagrange formalism
*** 1.8.5 Hamilton formalism
** 1.9 Units
** 1.10 Tools
*** 1.10.1 Maple/GRTensorII
*** 1.10.2 Mathematica
*** 1.10.3 [[file:maxima.org][maxima]]
* 2 Spacetimes
** 2.1 Minkowski
*** 2.1.1 Cartesian coordinates
*** 2.1.2 Cylindrical coordinates
*** 2.1.3 Spherical coordinates
*** 2.1.4 Conform-compactified coordinates
*** 2.1.5 Rotating coordinates
*** 2.1.6 Rindler coordinates
** 2.2 Schwarzschild spacetime
*** 2.2.1 Schwarzschild coordinates
*** 2.2.2 Schwarzschild in pseudo-Cartesian coordinates
*** 2.2.3 Isotropic coordinates
*** 2.2.4 Eddington-Finkelstein
*** 2.2.5 Kruskal-Szekeres
*** 2.2.6 Tortoise coordinates
*** 2.2.7 Painlevé-Gullstrand
*** 2.2.8 Israel coordinates
** 2.3 Alcubierre Warp
** 2.4 Barriola-Vilenkin monopol
** 2.5 Bertotti-Kasner
** 2.6 Bessel gravitational wave
*** 2.6.1 Cylindrical coordinates
*** 2.6.2 Cartesian coordinates
** 2.7 Cosmic string in Schwarzschild spacetime
** 2.8 Ernst spacetime
** 2.9 Friedman-Robertson-Walker
*** 2.9.1 Form 1
*** 2.9.2 Form 2
*** 2.9.3 Form 3
** 2.10 Gödel Universe
*** 2.10.1 Cylindrical coordinates
*** 2.10.2 Scaled cylindrical coordinates
** 2.11 Halilsoy standing wave
** 2.12 Janis-Newman-Winicour
** 2.13 Kasner
** 2.14 Kerr
*** 2.14.1 Boyer-Lindquist coordinates
** 2.15 Kottler spacetime
** 2.16 Morris-Thorne
** 2.17 Oppenheimer-Snyder collapse
*** 2.17.1 Outer metric
*** 2.17.2 Inner metric
** 2.18 Petrov-Type D – Levi-Civita spacetimes
*** 2.18.1 Case AI
*** 2.18.2 Case AII
*** 2.18.3 Case AIII
*** 2.18.4 Case BI
*** 2.18.5 Case BII
*** 2.18.6 Case BIII
*** 2.18.7 Case C
** 2.19 Plane gravitational wave
** 2.20 Reissner-Nordstrøm
** 2.21 de Sitter spacetime
*** 2.21.1 Standard coordinates
*** 2.21.2 Conformally Einstein coordinates
*** 2.21.3 Conformally flat coordinates
*** 2.21.4 Static coordinates
*** 2.21.5 Lemaître-Robertson form
*** 2.21.6 Cartesian coordinates
** 2.22 Straight spinning string
** 2.23 Sultana-Dyer spacetime
** 2.24 TaubNUT
