content/posts/Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009.md
+++
title = "Catalogue of Spacetimes by Mueller and Grave in 2009"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:08-04:00
slug = "Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009"
draft = false
+++

## 1 Introduction and Notation {#1-introduction-and-notation}


### 1.1 Notation {#1-dot-1-notation}


### 1.2 General remarks {#1-dot-2-general-remarks}


### 1.3 Basic objects of a metric {#1-dot-3-basic-objects-of-a-metric}


### 1.4 Natural local tetrad and initial conditions for geodesics {#1-dot-4-natural-local-tetrad-and-initial-conditions-for-geodesics}

<!--list-separator-->

-  1.4.1 Orthonormality condition

<!--list-separator-->

-  1.4.2 Tetrad transformations

<!--list-separator-->

-  1.4.3 Ricci rotation-, connection-, and structure coefficients

<!--list-separator-->

-  1.4.4 Riemann-, Ricci-, and Weyl-tensor with respect to a local tetrad

<!--list-separator-->

-  1.4.5 Null or timelike directions

<!--list-separator-->

-  1.4.6 Local tetrad for diagonal metrics

<!--list-separator-->

-  1.4.7 Local tetrad for stationary axisymmetric spacetimes


### 1.5 Newman-Penrose tetrad and spin-coefficients {#1-dot-5-newman-penrose-tetrad-and-spin-coefficients}


### 1.6 Coordinate relations {#1-dot-6-coordinate-relations}

<!--list-separator-->

-  1.6.1 Spherical and Cartesian coordinates

<!--list-separator-->

-  1.6.2 Cylindrical and Cartesian coordinates


### 1.7 Embedding diagram {#1-dot-7-embedding-diagram}


### 1.8 Equations of motion and transport equations {#1-dot-8-equations-of-motion-and-transport-equations}

<!--list-separator-->

-  1.8.1 Geodesic equation

<!--list-separator-->

-  1.8.2 Fermi-Walker transport

<!--list-separator-->

-  1.8.3 Parallel transport

<!--list-separator-->

-  1.8.4 Euler-Lagrange formalism

<!--list-separator-->

-  1.8.5 Hamilton formalism


### 1.9 Units {#1-dot-9-units}


### 1.10 Tools {#1-dot-10-tools}

<!--list-separator-->

-  1.10.1 Maple/GRTensorII

<!--list-separator-->

-  1.10.2 Mathematica

<!--list-separator-->

-  1.10.3 [maxima]({{< relref "maxima" >}})


## 2 Spacetimes {#2-spacetimes}


### 2.1 Minkowski {#2-dot-1-minkowski}

<!--list-separator-->

-  2.1.1 Cartesian coordinates

<!--list-separator-->

-  2.1.2 Cylindrical coordinates

<!--list-separator-->

-  2.1.3 Spherical coordinates

<!--list-separator-->

-  2.1.4 Conform-compactified coordinates

<!--list-separator-->

-  2.1.5 Rotating coordinates

<!--list-separator-->

-  2.1.6 Rindler coordinates


### 2.2 Schwarzschild spacetime {#2-dot-2-schwarzschild-spacetime}

<!--list-separator-->

-  2.2.1 Schwarzschild coordinates

<!--list-separator-->

-  2.2.2 Schwarzschild in pseudo-Cartesian coordinates

<!--list-separator-->

-  2.2.3 Isotropic coordinates

<!--list-separator-->

-  2.2.4 Eddington-Finkelstein

<!--list-separator-->

-  2.2.5 Kruskal-Szekeres

<!--list-separator-->

-  2.2.6 Tortoise coordinates

<!--list-separator-->

-  2.2.7 Painlevé-Gullstrand

<!--list-separator-->

-  2.2.8 Israel coordinates


### 2.3 Alcubierre Warp {#2-dot-3-alcubierre-warp}


### 2.4 Barriola-Vilenkin monopol {#2-dot-4-barriola-vilenkin-monopol}


### 2.5 Bertotti-Kasner {#2-dot-5-bertotti-kasner}


### 2.6 Bessel gravitational wave {#2-dot-6-bessel-gravitational-wave}

<!--list-separator-->

-  2.6.1 Cylindrical coordinates

<!--list-separator-->

-  2.6.2 Cartesian coordinates


### 2.7 Cosmic string in Schwarzschild spacetime {#2-dot-7-cosmic-string-in-schwarzschild-spacetime}


### 2.8 Ernst spacetime {#2-dot-8-ernst-spacetime}


### 2.9 Friedman-Robertson-Walker {#2-dot-9-friedman-robertson-walker}

<!--list-separator-->

-  2.9.1 Form 1

<!--list-separator-->

-  2.9.2 Form 2

<!--list-separator-->

-  2.9.3 Form 3


### 2.10 Gödel Universe {#2-dot-10-gödel-universe}

<!--list-separator-->

-  2.10.1 Cylindrical coordinates

<!--list-separator-->

-  2.10.2 Scaled cylindrical coordinates


### 2.11 Halilsoy standing wave {#2-dot-11-halilsoy-standing-wave}


### 2.12 Janis-Newman-Winicour {#2-dot-12-janis-newman-winicour}


### 2.13 Kasner {#2-dot-13-kasner}


### 2.14 Kerr {#2-dot-14-kerr}

<!--list-separator-->

-  2.14.1 Boyer-Lindquist coordinates


### 2.15 Kottler spacetime {#2-dot-15-kottler-spacetime}


### 2.16 Morris-Thorne {#2-dot-16-morris-thorne}


### 2.17 Oppenheimer-Snyder collapse {#2-dot-17-oppenheimer-snyder-collapse}

<!--list-separator-->

-  2.17.1 Outer metric

<!--list-separator-->

-  2.17.2 Inner metric


### 2.18 Petrov-Type D – Levi-Civita spacetimes {#2-dot-18-petrov-type-d-levi-civita-spacetimes}

<!--list-separator-->

-  2.18.1 Case AI

<!--list-separator-->

-  2.18.2 Case AII

<!--list-separator-->

-  2.18.3 Case AIII

<!--list-separator-->

-  2.18.4 Case BI

<!--list-separator-->

-  2.18.5 Case BII

<!--list-separator-->

-  2.18.6 Case BIII

<!--list-separator-->

-  2.18.7 Case C


### 2.19 Plane gravitational wave {#2-dot-19-plane-gravitational-wave}


### 2.20 Reissner-Nordstrøm {#2-dot-20-reissner-nordstrøm}


### 2.21 de Sitter spacetime {#2-dot-21-de-sitter-spacetime}

<!--list-separator-->

-  2.21.1 Standard coordinates

<!--list-separator-->

-  2.21.2 Conformally Einstein coordinates

<!--list-separator-->

-  2.21.3 Conformally flat coordinates

<!--list-separator-->

-  2.21.4 Static coordinates

<!--list-separator-->

-  2.21.5 Lemaître-Robertson form

<!--list-separator-->

-  2.21.6 Cartesian coordinates


### 2.22 Straight spinning string {#2-dot-22-straight-spinning-string}


### 2.23 Sultana-Dyer spacetime {#2-dot-23-sultana-dyer-spacetime}


### 2.24 TaubNUT {#2-dot-24-taubnut}
